SSO Auth - Update digrams in dev docs
