--- a/src/authentication/README.md
+++ b/src/authentication/README.md
@@ -169,63 +180,69 @@ Memex->ChargebeeServer: Get ${Checkout URL}
 
 ### Refresh Authentication
 
-```puml
-+-------+                                      +-----------+                                         +---------------+
-| Memex |                                      | Firebase  |                                         | ChargebeeAPI  |
-+-------+                                      +-----------+                                         +---------------+
-    |                                                |                                                       |
-    | refreshUser                                    |                                                       |
-    |----------------------------------------------->|                                                       |
-    |                                                | ------------------------------\                       |
-    |                                                |-| Check user is authenticated |                       |
-    |                                                | |-----------------------------|                       |
-    |                                                | ---------------------------------------\              |
-    |                                                |-| Get all valid subscriptions for user |              |
-    |                                                | |--------------------------------------|              |
-    |                                                |                                                       |
-    |                                                | chargebee.subscription.list(query)                    |
-    |                                                |------------------------------------------------------>|
-    |                                                |                                                       |
-    |                                                |                             ${Subscriptions} for user |
-    |                                                |<------------------------------------------------------|
-    |                                                | ----------------------------------------------\       |
-    |                                                |-| for all subscriptions, check they are valid |       |
-    |                                                | |---------------------------------------------|       |
-    |                                                | --------------------------\                           |
-    |                                                |-| get subscription expiry |                           |
-    |                                                | |-------------------------|                           |
-    |                                                | --------------------------------------------\         |
-    |                                                |-| "FirebaseAuth Admin                       |         |
-    |                                                | | -> setCustomClaims(userId,subscriptions)" |         |
-    |                                                | |-------------------------------------------|         |
-    |                                          done. |                                                       |
-    |<-----------------------------------------------|                                                       |
-    | -------------------------------------\         |                                                       |
-    |-| "ReAuthenticate with Firebase Auth |         |                                                       |
-    | | using existing credentials."       |         |                                                       |
-    | -----------------------------------------\     |                                                       |
-    |-| new subscription claims are picked up. |     |                                                       |
-    | |----------------------------------------|     |                                                       |
-    |                                                |                                                       |
+```
+     ┌─────┐          ┌─────────────┐                     ┌────────────┐          ┌────────────┐
+     │Memex│          │FirebaseFuncs│                     │ChargebeeAPI│          │FirebaseAuth│
+     └──┬──┘          └──────┬──────┘                     └─────┬──────┘          └─────┬──────┘
+        │    refreshUser     │                                  │                       │
+        │───────────────────>│                                  │                       │
+        │                    │                                  │                       │
+        │                    │ ╔═════════════════════════════╗  │                       │
+        │                    │-║Check user is authenticated ░║  │                       │
+        │                    │ ╚═════════════════════════════╝  │                       │
+        │                    │ ╔════════════════════════════════╧═════╗                 │
+        │                    │-║Get all valid subscriptions for user ░║                 │
+        │                    │ ╚════════════════════════════════╤═════╝                 │
+        │                    │chargebee.subscription.list(query)│                       │
+        │                    │──────────────────────────────────>                       │
+        │                    │                                  │                       │
+        │                    │    ${Subscriptions} for user     │                       │
+        │                    │<──────────────────────────────────                       │
+        │                    │                                  │                       │
+        │                    │ ╔════════════════════════════════╧═══════╗               │
+        │                    │-║for all subscriptions, check validity, ░║               │
+        │                    │ ║get subscription expiry                 ║               │
+        │                    │ ╚════════════════════════════════╤═══════╝               │
+        │                    │         FirebaseAuth Admin       │                       │
+        │                    │         -> setCustomClaims(userId,subscriptions)         │
+        │                    │──────────────────────────────────────────────────────────>
+        │                    │                                  │                       │
+        │       done.        │                                  │                       │
+        │<───────────────────│                                  │                       │
+        │                    │                                  │                       │
+        │  auth.refresh()                                                               │
+        │  ReAuthenticate using existing credentials.                                   │
+        │───────────────────────────────────────────────────────────────────────────────>
+        │                                                                               │
+        │                                             User with new subscription claims │
+        │<───────────────────────────────────────────────────────────────────────────────
+        │                    │                                  │                       │
+        │ ╔══════════════════╧════════════════════════════╗     │                       │
+        │-║Auth changed handler fires with updated user. ░║     │                       │
+        ┴ ╚═══════════════════════════════════════════════╝
 ```
 
-(source)
-
